                    
&НаКлиенте
Функция Показать(ПараметрыФормы)Экспорт
	
	ЕдиницаИзмерения = ПараметрыФормы.ЕдиницаИзмерения;	
	ЕдиницаEDI = ПараметрыФормы.ЕдиницаEDI;

	КоэффициентEDIВ1С = ПараметрыФормы.КоэффициентEDIВ1С;   
	
		
	Элементы.КоличествоЕдиниц1С.Заголовок = Строка(ЕдиницаИзмерения) + " (1С)";
	Элементы.КоличествоЕдиницEDI.Заголовок = ЕдиницаEDI + " (EDI)";
	
	КоличествоЕдиниц1С = КоэффициентEDIВ1С;
	КоличествоЕдиницEDI = ?(ЗначениеЗаполнено(КоэффициентEDIВ1С), 1, 0);
		
	Если Не ЭтаФорма.Открыта() Тогда
		ЭтаФорма.Открыть();
	КонецЕсли;	
КонецФункции



&НаКлиенте
Процедура ЗаписатьПересчеты(Команда)
	
	КоэффициентEDIВ1С = Окр(КоличествоЕдиниц1С / КоличествоЕдиницEDI, 3);
	
	Структура = Новый Структура("КоэффициентEDIВ1С", КоэффициентEDIВ1С);  
	
	ЭтаФорма.Закрыть(Структура);
	
КонецПроцедуры
