
&НаКлиенте
Перем МестныйКэш Экспорт;

#Область include_core2_vo2_Формы_МассоваяРассылка_ВнешнийВызов

&НаКлиенте
Процедура ПоказатьФорму(Кэш)Экспорт
	ЭтаФорма.Открыть();
	МестныйКэш = Кэш;
КонецПроцедуры

#КонецОбласти

#Область include_core2_vo2_Формы_МассоваяРассылка_Прочее

&НаКлиенте
Процедура ЗаполнитьТаблицу(МестныйКэш) 
	ДополнительныеВложения.Очистить();
	сч = 0;
	Для Каждого Вложение Из МестныйКэш.ДопВложение Цикл
		НоваяСтр = ДополнительныеВложения.Добавить();
		НоваяСтр.НомерВложенияВПакете = сч;
		Если Вложение.Свойство("Название") Тогда
			НоваяСтр.Название = Вложение.Название;
		КонецЕсли;
		сч = сч+1;
	КонецЦикла;		
КонецПроцедуры

&НаКлиенте
Функция сбисЭлементФормы(Форма,ИмяЭлемента)
	Если ТипЗнч(ЭтаФорма) = Тип("УправляемаяФорма") Тогда
		Возврат Форма.Элементы.Найти(ИмяЭлемента);
	КонецЕсли;
	Возврат Форма.ЭлементыФормы.Найти(ИмяЭлемента);
КонецФункции

#КонецОбласти

#Область include_core2_vo2_Формы_МассоваяРассылка_Команды

&НаКлиенте
Процедура ДобавитьВложение(Команда)
	// Процедура добавляет внешний файл в кэш
	ДиалогОткрытияФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие); 
	ДиалогОткрытияФайла.МножественныйВыбор = Истина;
	ДиалогОткрытияФайла.Заголовок = "Выберите файлы";
	Если ДиалогОткрытияФайла.Выбрать() Тогда
		МассивФайлов = ДиалогОткрытияФайла.ВыбранныеФайлы;
		Для Каждого ИмяФайла Из МассивФайлов Цикл
			Файл = Новый Файл(ИмяФайла);
			МестныйКэш.ДопВложение.Добавить(Новый Структура("ПолноеИмяФайла,ИмяФайла,Название,XMLДокумента",Файл.ПолноеИмя, Файл.Имя, Файл.Имя,""));
		КонецЦикла;
		ЗаполнитьТаблицу(МестныйКэш);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура УдалитьВложение(Команда)
	//Процедура удаляет вложение из пакета
	Если сбисЭлементФормы(ЭтаФорма,"ДополнительныеВложения").ТекущиеДанные<>Неопределено Тогда
		МестныйКэш.ДопВложение.Удалить(сбисЭлементФормы(ЭтаФорма,"ДополнительныеВложения").ТекущиеДанные.НомерВложенияВПакете);
		ЗаполнитьТаблицу(МестныйКэш);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область include_core2_vo2_Формы_МассоваяРассылка_События

&НаКлиенте
Процедура ДополнительныеВложенияВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Если	Поле.Имя = "ДополнительныеВложенияУдалить"
		Или	Поле.Имя = "Удалить" Тогда
		УдалитьВложение("");
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область include_local_Формы_МассоваяРассылка_События



#КонецОбласти
